# 普段利用するアプリ
#################
cask "anki"
cask "discord"
cask "google-chrome"
cask "google-chrome@beta"
cask "google-drive"
cask "google-japanese-ime"
cask "iina"
cask "karabiner-elements"
cask "logi-options+"
cask "mas" # App Store のアプリを CLI で管理できる
cask "obs"
cask "raycast"
cask "slack"
cask "vial" # キーボードのカスタマイズツール
cask "vlc"
cask "wpsoffice" # 仕事でたまに使う
cask "zoom"
# cask "betterdisplay"  # 母艦のみ
# cask "the-unarchiver" # 現代では rar の展開にしか使わないから不要かも
# cask "elgato-stream-deck" # 意外と使わないのでコメントアウト

# 開発系
################

# Essentials
brew "eza"
brew "fd"
brew "mise"
brew "ripgrep"
brew "sqlite"
brew "tmux"
cask "docker-desktop"
cask "tailscale-app"
cask "warp"

# Cloud Platform
brew "awscli"
brew "firebase-cli"
cask "gcloud-cli"

# Cloud Tools
brew "gh"
brew "gitlab-runner"
brew "glab"
brew "huggingface-cli"
brew "newrelic-cli"
cask "ngrok"

# IDE/Editor
cask "android-studio"
cask "phpstorm"
cask "rubymine"
cask "sublime-text" # 軽いエディタが使いたい時にあると便利。zedより好き
cask "visual-studio-code"
cask "webstorm"

# JavaScript/TypeScript
brew "biome"

# PHP
cask "herd" # PHP は mise で管理が難しいので、herd で管理することにした

# Other Tools
brew "cmake" # for whisper.cpp
brew "duckdb"
brew "ffmpeg"
brew "act" # nektos/act
cask "claude-code"
cask "cryptomator"
cask "cursor"
cask "figma"
cask "lm-studio"
cask "postman"
cask "tableplus"

# Other Libs
brew "libpg"
brew "libyaml" # mise で ruby をインストールする際に psych のコンパイルでエラーにならないようにするため

## for Kindle Comic Converter
brew "p7zip"
brew "unar"
cask "kindle-previewer"
cask "kindle-comic-converter"

## mise で php を管理する際は内部的に asdf-php を利用している
## asdf-php は以下のパッケージが必要 see: https://github.com/asdf-community/asdf-php/blob/248e9c6e2a7824510788f05e8cee848a62200b65/.github/workflows/workflow.yml#L52
# brew "autoconf"
# brew "automake"
# brew "bison"
# brew "freetype"
# brew "gd"
# brew "gettext"
# brew "icu4c"
# brew "krb5"
# brew "libedit"
# brew "libiconv"
# brew "libjpeg"
# brew "libpng"
# brew "libxml2"
# brew "libzip"
# brew "pkg-config"
# brew "re2c"
# brew "zlib"
